class script(object):
    START_TXT = """<b>ʜᴇʏ {}, <i>{}</i>
    
ɪ ᴀᴍ ᴘᴏᴡᴇʀғᴜʟ ᴀᴜᴛᴏ ғɪʟᴛᴇʀ ᴡɪᴛʜ ʟɪɴᴋ sʜᴏʀᴛᴇɴᴇʀ ʙᴏᴛ.
ʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ ᴀꜱ ᴀᴜᴛᴏ ғɪʟᴛᴇʀ ᴡɪᴛʜ ʟɪɴᴋ sʜᴏʀᴛᴇɴᴇʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
ɪᴛ'ꜱ ᴇᴀꜱʏ ᴛᴏ ᴜꜱᴇ ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ᴀꜱ ᴀᴅᴍɪɴ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ɪ ᴡɪʟʟ ᴘʀᴏᴠɪᴅᴇ ᴛʜᴇʀᴇ ᴍᴏᴠɪᴇꜱ ᴡɪᴛʜ ʏᴏᴜʀ ʟɪɴᴋ ꜱʜᴏʀᴛᴇɴᴇʀ. ♻️</b>"""

    MY_ABOUT_TXT = """<b>★ sᴇʀᴠᴇʀ :</b> <a href=https://www.heroku.com>ʜᴇʀᴏᴋᴜ</a>
<b>★ ᴅᴀᴛᴀʙᴀsᴇ :</b> <a href=https://www.mongodb.com>ᴍᴏɴɢᴏ ᴅʙ</a>
<b>★ ʟᴀɴɢᴜᴀɢᴇ :</b> <a href=https://www.python.org>ᴘʏᴛʜᴏɴ</a>
<b>★ ʟɪʙʀᴀʀʏ :</b> <a href=https://pyrogram.org>ᴘʏʀᴏɢʀᴀᴍ</a>"""

    MY_OWNER_TXT = """★ ɴᴀᴍᴇ : sᴠɴ
★ ᴜsᴇʀɴᴀᴍᴇ : @cntct_7bot
★ ᴜᴘᴅᴀᴛᴇ ᴄʜᴀɴɴᴇʟ : @imdbposters"""

    STATUS_TXT = """<b>╭━━━━━━━━❰sᴛᴀᴛᴜs ʙᴀʀ❱══❍⊱❁۪۪
┣⪼𖨠 🗃️ ᴛᴏᴛᴀʟ ꜰɪʟᴇs : <code>{}</code>
┣⪼𖨠 👤 ᴛᴏᴛᴀʟ ᴜsᴇʀs : <code>{}</code>
┣⪼𖨠 ♻️ ᴛᴏᴛᴀʟ ᴄʜᴀᴛs : <code>{}</code>
┣⪼𖨠 ✨ ᴜsᴇᴅ sᴛᴏʀᴀɢᴇ : <code>{}</code>
┣⪼𖨠 🆓 ꜰʀᴇᴇ sᴛᴏʀᴀɢᴇ : <code>{}</code>
┣⪼𖨠 🚀 ʙᴏᴛ ᴜᴩᴛɪᴍᴇ : <code>{}</code> 
╰━━━━━━━━━━━━━━━━══❍⊱❁۪۪</b>"""

    NEW_GROUP_TXT = """#ɴᴇᴡɢʀᴏᴜᴘ
ᴛɪᴛʟᴇ - {}
ɪᴅ - <code>{}</code>
ᴜsᴇʀɴᴀᴍᴇ - {}
ᴛᴏᴛᴀʟ - <code>{}</code>"""

    NEW_USER_TXT = """#ɴᴇᴡᴜsᴇʀ
★ ɴᴀᴍᴇ : {}
★ ɪᴅ : <code>{}</code>"""

    NO_RESULT_TXT = """#ɴᴏʀᴇsᴜʟᴛ
★ ɢʀᴏᴜᴘ ɴᴀᴍᴇ : {}
★ ɢʀᴏᴜᴘ ɪᴅ : <code>{}</code>
★ ɴᴀᴍᴇ : {}

★ ᴍᴇssᴀɢᴇ : {}"""

    REQUEST_TXT = """★ ɴᴀᴍᴇ : {}
★ ɪᴅ : <code>{}</code>

★ ᴍᴇssᴀɢᴇ : {}"""

    NOT_FILE_TXT = """👋 ʜᴇʟʟᴏ {},

ɪ ᴄᴀɴ'ᴛ ғɪɴᴅ ᴛʜᴇ <b>{}</b> ɪɴ ᴍʏ ᴅᴀᴛᴀʙᴀsᴇ ! 🥲

👉 ɢᴏᴏɢʟᴇ sᴇᴀʀᴄʜ ᴀɴᴅ ᴄʜᴇᴄᴋ ʏᴏᴜʀ sᴘᴇʟʟɪɴɢ ɪs ᴄᴏʀʀᴇᴄᴛ.
👉 ᴘʟᴇᴀsᴇ ʀᴇᴀᴅ ᴛʜᴇ ɪɴsᴛʀᴜᴄᴛɪᴏɴs ᴛᴏ ɢᴇᴛ ʙᴇᴛᴛᴇʀ ʀᴇsᴜʟᴛs.
👉 ᴏʀ ɴᴏᴛ ʙᴇᴇɴ ʀᴇʟᴇᴀsᴇᴅ ʏᴇᴛ."""
    
    EARN_TXT = """<b>ʜᴏᴡ ᴛᴏ ᴇᴀʀɴ ꜰʀᴏᴍ ᴛʜɪs ʙᴏᴛ

➥ ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ ᴇᴀʀɴ ᴍᴏɴᴇʏ ʙʏ ᴜsɪɴɢ ᴛʜɪꜱ ʙᴏᴛ.

» sᴛᴇᴘ 1 :- ғɪʀsᴛ ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏ ᴀᴅᴅ ᴛʜɪs ʙᴏᴛ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ.

» sᴛᴇᴘ 2 :- ᴍᴀᴋᴇ ᴀᴄᴄᴏᴜɴᴛ ᴏɴ <a href=https://onepagelink.in/ref/infinity07>onepagelink.in</a> [ ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ ᴜsᴇ ᴏᴛʜᴇʀ sʜᴏʀᴛɴᴇʀ ᴡᴇʙsɪᴛᴇ ]

» sᴛᴇᴘ 3 :- ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴇʟᴏᴡ ɢɪᴠᴇɴ ʙᴜᴛᴛᴏɴ ᴛᴏ ᴋɴᴏᴡ ʜᴏᴡ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ sʜᴏʀᴛɴᴇʀ ᴡɪᴛʜ ᴛʜɪs ʙᴏᴛ.

➥ ᴛʜɪꜱ ʙᴏᴛ ɪs ꜰʀᴇᴇ ꜰᴏʀ ᴀʟʟ,
ʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ ᴛʜɪꜱ ʙᴏᴛ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘs ғᴏʀ ꜰʀᴇᴇ ᴏꜰ ᴄᴏꜱᴛ.</b>"""

    HOW_TXT = """<b>ʜᴏᴡ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ ᴏᴡɴ sʜᴏʀᴛɴᴇʀ ‼️

➥ ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ ᴏᴡɴ sʜᴏʀᴛɴᴇʀ ᴛʜᴇɴ ᴊᴜsᴛ sᴇɴᴅ ᴛʜᴇ ɢɪᴠᴇɴ ᴅᴇᴛᴀɪʟs ɪɴ ᴄᴏʀʀᴇᴄᴛ ꜰᴏʀᴍᴀᴛ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ

➥ ғᴏʀᴍᴀᴛ ↓↓↓

<code>/set_shortlink sʜᴏʀᴛɴᴇʀ sɪᴛᴇ sʜᴏʀᴛɴᴇʀ ᴀᴘɪ</code>

➥ ᴇxᴀᴍᴘʟᴇ ↓↓↓

<code>/set_shortlink onepagelink.in f646357aa129cfbd7eb59bcba428096ab54ca950</code>

➥ ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴄʜᴇᴄᴋ ᴡʜɪᴄʜ sʜᴏʀᴛᴇɴᴇʀ ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛʜᴇɴ sᴇɴᴅ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ /get_shortlink

📝 ɴᴏᴛᴇ :- ʏᴏᴜ sʜᴏᴜʟᴅ ɴᴏᴛ ʙᴇ ᴀɴ ᴀɴᴏɴʏᴍᴏᴜs ᴀᴅᴍɪɴ ɪɴ ɢʀᴏᴜᴘ. sᴇɴᴅ ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜᴏᴜᴛ ʙᴇɪɴɢ ᴀɴ ᴀɴᴏɴʏᴍᴜs ᴀᴅᴍɪɴ.</b>"""

    IMDB_TEMPLATE = """✅ **ɪ ғᴏᴜɴᴅ :** <code>{query}</code>

🏷 **ᴛɪᴛʟᴇ :** <a href={url}>{title}</a>
🎭 **ɢᴇɴʀᴇs :** {genres}
📆 **ʏᴇᴀʀ :** <a href={url}/releaseinfo>{year}</a>
🌟 **ʀᴀᴛɪɴɢ :** <a href={url}/ratings>{rating} / 10</a>
☀️ **ʟᴀɴɢᴜᴀɢᴇs :** {languages}
📀 **ʀᴜɴᴛɪᴍᴇ :** {runtime} ᴍɪɴᴜᴛᴇs

🗣 **ʀᴇᴏ̨ᴜᴇsᴛᴇᴅ ʙʏ :** {message.from_user.mention}
©️ **ᴘᴏᴡᴇʀᴇᴅ ʙʏ :** <b>{message.chat.title}</b>"""

    FILE_CAPTION = """<b>{file_caption}</b>

🚫 ᴘʟᴇᴀsᴇ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ᴄʟᴏsᴇ ʙᴜᴛᴛᴏɴ ɪꜰ ʏᴏᴜ ʜᴀᴠᴇ sᴇᴇɴ ᴛʜᴇ ᴍᴏᴠɪᴇ 🚫"""

    WELCOME_TEXT = """👋 ʜᴇʟʟᴏ {mention},
    ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ {title} ɢʀᴏᴜᴘ ! 💞"""

    HELP_TXT = """<b>ɴᴏᴛᴇ - <spoiler>ᴛʀʏ ᴇᴀᴄʜ ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴀʀɢᴜᴍᴇɴᴛ ᴛᴏ sᴇᴇ ᴍᴏʀᴇ ᴅᴇᴛᴀɪʟs 😹</spoiler></b>"""
    
    ADMIN_COMMAND_TXT = """<b>ʜᴇʀᴇ ɪs ʙᴏᴛ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs 👇

/index_channels - ᴛᴏ ᴄʜᴇᴄᴋ ʜᴏᴡ ᴍᴀɴʏ ɪɴᴅᴇx ᴄʜᴀɴɴᴇʟ ɪᴅ ᴀᴅᴅᴇᴅ
/stats - ᴛᴏ ɢᴇᴛ ʙᴏᴛ sᴛᴀᴛᴜs
/delete - ᴛᴏ ᴅᴇʟᴇᴛᴇ ғɪʟᴇs ᴜsɪɴɢ ᴏ̨ᴜᴇʀʏ
/delete_all - ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ ɪɴᴅᴇxᴇᴅ ғɪʟᴇ
/broadcast - ᴛᴏ sᴇɴᴅ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ʙᴏᴛ ᴜsᴇʀs
/grp_broadcast - ᴛᴏ sᴇɴᴅ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ɢʀᴏᴜᴘs
/pin_broadcast - ᴛᴏ sᴇɴᴅ ᴍᴇssᴀɢᴇ ᴀs ᴘɪɴ ᴛᴏ ᴀʟʟ ʙᴏᴛ ᴜsᴇʀs
/pin_grp_broadcast - ᴛᴏ sᴇɴᴅ ᴍᴇssᴀɢᴇ ᴀs ᴘɪɴ ᴛᴏ ᴀʟʟ ɢʀᴏᴜᴘs
/restart - ᴛᴏ ʀᴇsᴛᴀʀᴛ ʙᴏᴛ
/speedtest - ᴄʜᴇᴄᴋ ᴜʟ / ᴅʟ
/leave - ᴛᴏ ʟᴇᴀᴠᴇ ʏᴏᴜʀ ʙᴏᴛ ғʀᴏᴍ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ɢʀᴏᴜᴘ
/unban_grp - ᴛᴏ ᴇɴᴀʙʟᴇ ɢʀᴏᴜᴘ
/ban_grp - ᴛᴏ ᴅɪsᴀʙʟᴇ ɢʀᴏᴜᴘ
/ban_user - ᴛᴏ ʙᴀɴ ᴜsᴇʀs ғʀᴏᴍ ʙᴏᴛ
/unban_user - ᴛᴏ ᴜɴʙᴀɴ ᴜsᴇʀs ғʀᴏᴍ ʙᴏᴛ
/users - ᴛᴏ ɢᴇᴛ ᴀʟʟ ᴜsᴇʀs ᴅᴇᴛᴀɪʟs
/chats - ᴛᴏ ɢᴇᴛ ᴀʟʟ ɢʀᴏᴜᴘs
/invite_link - ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ɪɴᴠɪᴛᴇ ʟɪɴᴋ
/index - ᴛᴏ ɪɴᴅᴇx ʙᴏᴛ ᴀᴄᴄᴇssɪʙʟᴇ ᴄʜᴀɴɴᴇʟs
/add_premium - ᴛᴏ ᴀᴅᴅ ᴜsᴇʀ ɪɴ ᴘʀᴇᴍɪᴜᴍ
/remove_premium - ᴛᴏ ʀᴇᴍᴏᴠᴇ ᴜsᴇʀ ғʀᴏᴍ ᴘʀᴇᴍɪᴜᴍ</b>"""

    GROUP_COMMAND_TXT = """<b>ʜᴇʀᴇ ɪs sᴏᴍᴇ ( ɢʀᴏᴜᴘ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ) ɢʀᴏᴜᴘ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs
/manage - ᴛᴏ ᴘᴇʀғᴏʀᴍ ʙᴜʟᴋ ɢʀᴏᴜᴘ ᴀᴄᴛɪᴏɴs
/ban - ᴛᴏ ʙᴀɴ ᴀ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ
/unban - ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ
/mute - ᴛᴏ ᴍᴜᴛᴇ ᴀ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ
/unmute - ᴛᴏ ᴜɴᴍᴜᴛᴇ ᴀ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ
/settings - ᴛᴏ ᴄʜᴀɴɢᴇ ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs ᴀs ʏᴏᴜʀ ᴡɪsʜ
/set_template - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ɪᴍᴅʙ ᴛᴇᴍᴘʟᴀᴛᴇ
/set_caption - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ʙᴏᴛ ғɪʟᴇs ᴄᴀᴘᴛɪᴏɴ
/set_shortlink - ɢʀᴏᴜᴘ ᴀᴅᴍɪɴ ᴄᴀɴ sᴇᴛ ᴄᴜsᴛᴏᴍ sʜᴏʀᴛʟɪɴᴋ
/get_custom_settings - ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs ᴅᴇᴛᴀɪʟs
/set_welcome - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ɴᴇᴡ ᴊᴏɪɴᴇᴅ ᴜsᴇʀs ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ ғᴏʀ ɢʀᴏᴜᴘ
/set_tutorial - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ᴛᴜᴛᴏʀɪᴀʟ ʟɪɴᴋ ɪɴ ʀᴇsᴜʟᴛ ᴘᴀɢᴇ ʙᴜᴛᴛᴏɴ
/id - ᴛᴏ ᴄʜᴇᴄᴋ ɢʀᴏᴜᴘ ᴏʀ ᴄʜᴀɴɴᴇʟ ɪᴅ

    ᴍᴀᴋᴇ sᴜʀᴇ ᴛʜᴀᴛ ʙᴏᴛ ʜᴀs ᴀʟʟ ᴘᴇʀᴍɪssɪᴏɴ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ ᴀs ᴀᴅᴍɪɴɪsᴛʀᴀᴛᴏʀ.</b>"""
    
    USER_COMMAND_TXT = """<b>ʜᴇʀᴇ ɪs ʙᴏᴛ ᴜsᴇʀ ᴄᴏᴍᴍᴀɴᴅs 👇

/start - ᴛᴏ ᴄʜᴇᴄᴋ ʙᴏᴛ ᴀʟɪᴠᴇ ᴏʀ ɴᴏᴛ
/settings - ᴛᴏ ᴄʜᴀɴɢᴇ ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs ᴀs ʏᴏᴜʀ ᴡɪsʜ
/set_template - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ɪᴍᴅʙ ᴛᴇᴍᴘʟᴀᴛᴇ
/set_caption - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ʙᴏᴛ ғɪʟᴇs ᴄᴀᴘᴛɪᴏɴ
/set_shortlink - ɢʀᴏᴜᴘ ᴀᴅᴍɪɴ ᴄᴀɴ sᴇᴛ ᴄᴜsᴛᴏᴍ sʜᴏʀᴛʟɪɴᴋ
/get_custom_settings - ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs ᴅᴇᴛᴀɪʟs
/set_welcome - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ɴᴇᴡ ᴊᴏɪɴᴇᴅ ᴜsᴇʀs ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ ғᴏʀ ɢʀᴏᴜᴘ
/set_tutorial - ᴛᴏ sᴇᴛ ᴄᴜsᴛᴏᴍ ᴛᴜᴛᴏʀɪᴀʟ ʟɪɴᴋ ɪɴ ʀᴇsᴜʟᴛ ᴘᴀɢᴇ ʙᴜᴛᴛᴏɴ
/id - ᴛᴏ ᴄʜᴇᴄᴋ ɢʀᴏᴜᴘ ᴏʀ ᴄʜᴀɴɴᴇʟ ɪᴅ
/my_plan - ᴛᴏ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ ᴅᴇᴛᴀɪʟs
/plans - ᴛᴏ ɢᴇᴛ ᴘʟᴀɴ ᴅᴇᴛᴀɪʟs</b>"""

    SOURCE_TXT = """<b>- ꜱᴏᴜʀᴄᴇ -</b> <a href=https://t.me/cntct_7bot>ʜᴇʀᴇ</a>

<b>- ᴅᴇᴠʟᴏᴘᴇʀ -</b> @cntct_7bot"""
